[
	{
		"quote": "Neil entertained over 200 attendees from around the world at Copy Capital and was one of the most talked about speakers, bravely touching on real issues. <strong>He should be on every conference agenda</strong>.",
		"fuller_quote": "Neil entertained over 200 attendees from around the world at Copy Capital. He was one of the most talked about speakers, bravely touching on very real issues. He talks with humility and humour so he enlightens and entertains. <strong>He should be on every conference agenda</strong> as we all work together to banish stigmas in the workplace.",
		"cite": "Vikki Ross"
	},
	{
		"quote": "Addresses serious topics with a great sense of humour, putting us all at ease to discuss a subject that no one discusses openly in the workplace. <strong>Great content and delivery, and good fun!</strong>",
		"cite": "Alicia Benito Martinez, <a href='http://ebrd.com/home'>European Bank for Reconstruction and Development</a>"
	},
	{
		"quote": "Having Neil speak at our Staff Away Day was a great way to get each team member to reflect on how we think about ourselves and how this can improve wellbeing at work.",
		"cite": "<a href='http://www.wiredaerialtheatre.com/'>Wired Aerial Theatre Company</a>"
	},
	{
		"quote": "Despite the event taking place virtually, <strong>Neil was able to reveal his ideas and witty personality through the screen</strong>, instantly becoming the fan-favourite at the event!",
		"fuller_quote": "Neil Hughes gave a brilliant and inspiring presentation at the 3rd Annual Trent Graduate Students Symposium (TGSS) event, and had a message applicable and relevant to all graduate students from all walks of life. Neil created a lasting impression on the audience through his incredible humour and helpful advice while depicting everything you need to know about multipotentiality. He spoke about his own life story and real life case studies that demonstrated how to utilize your multiple talents and skills to develop your dream career. Neil spoke about dealing with the feelings of anxiety when it comes to failure and reminded students to choose to view success when it comes to doing what you love. Despite the event taking place virtually, he was still able to reveal his ideas and witty personality through the screen, instantly becoming the fan-favourite at the event!. When asked about thoughts on his presentation, a Trent graduate student said, 'Great! I related strongly to the topics presented. Well spoken and funny.' Another Trent graduate student said, 'Really loved this talk, I thought he had such an interesting perspective and I think he's convinced me to embrace my inner multipotentialite!!!'",
		"cite": "<a href='https://www.trentu.ca/'>Trent University</a>"
	},
	{
		"quote": "Brilliant... inspiring... Neil created a lasting impression on the audience through his <strong>incredible humour and helpful advice</strong>.",
		"fuller_quote": "Neil Hughes gave a brilliant and inspiring presentation at the 3rd Annual Trent Graduate Students Symposium (TGSS) event, and had a message applicable and relevant to all graduate students from all walks of life. Neil created a lasting impression on the audience through his incredible humour and helpful advice while depicting everything you need to know about multipotentiality. He spoke about his own life story and real life case studies that demonstrated how to utilize your multiple talents and skills to develop your dream career. Neil spoke about dealing with the feelings of anxiety when it comes to failure and reminded students to choose to view success when it comes to doing what you love. Despite the event taking place virtually, he was still able to reveal his ideas and witty personality through the screen, instantly becoming the fan-favourite at the event!. When asked about thoughts on his presentation, a Trent graduate student said, 'Great! I related strongly to the topics presented. Well spoken and funny.' Another Trent graduate student said, 'Really loved this talk, I thought he had such an interesting perspective and I think he's convinced me to embrace my inner multipotentialite!!!'",
		"cite": "<a href='https://www.trentu.ca/'>Trent University</a>"
	}
]
