[
	{
		"quote": "Equally mischievous and sincere, <em>The Shop Before Life</em> is a witty, whimsical ride that squares off against some of the biggest existential questions around.",
		"cite": "Sienna Tristen, author of <em>The Heretic's Guide to Homecoming</em>"
	},
	{
		"quote": "One of those books that will stay with me for a while, if not for the rest of my life. There’s just something so unique and real about it and I just felt very connected to the themes it presented.",
		"cite": "Alice, <a target='_blank' rel='noopener noreferrer' href='https://mymindspeaksaloud.wordpress.com/2019/10/28/the-shop-before-life-by-neil-hughes-gifted-book-review/'>My Mind Speaks Aloud</a>"
	},
	{
		"quote": "A surprisingly fresh and unique take on what happens before you're born. Funny, unique, and appealing; this was a more than enjoyable read!",
		"cite": "Erin Cataldi, <a target='_blank' rel='noopener noreferrer' href='http://barbarianlibrarian1.blogspot.com/2019/11/the-shop-before-life.html'>Barbarian Librarian</a>"
	},
	{
		"quote": "I encourage everyone to read this story. It’s highly entertaining, thought-provoking, and the perfect book for many age groups.",
		"cite": "Kameron Brook, <a target='_blank' rel='noopener noreferrer' href='https://www.superkambrook.com/2020/01/review-of-the-shop-before-life-neil-hughes.html'>superkambrook.com</a>"
	},
	{
		"quote": "WOW! I can say with all candidness that The Shop Before Life is a book that will stay with me. I can unequivocally recommend The Shop Before Life; it is a book that I look forward to rereading many times.",
		"cite": "Cynthia, <a target='_blank' rel='noopener noreferrer' href='https://www.goodreads.com/review/show/3105931433?book_show_action=true'>goodreads.com</a>"
	},
	{
		"quote": "Truly exceptional book. Reminded me of Philip Pullman's Golden Compass series. I'm sure Faythe and Lyra would be kindred spirits. The writing is almost magical as it pulled me into this alternate universe. It has been awhile since I became so immersed in a book.",
		"cite": "Carlin, <a target='_blank' rel='noopener noreferrer' href='https://www.goodreads.com/review/show/3096771832?book_show_action=true'>goodreads.com</a>"
	},
	{
		"quote": "The writing style was engaging and the dialogue was funny. I found myself equal parts delighted and excited to read what comes next. It’s definitely a fun fantasy book for all ages that I highly recommend.",
		"cite": "AltLovesBooks, <a target='_blank' rel='noopener noreferrer' href='https://www.goodreads.com/review/show/3087181167?book_show_action=true'>goodreads.com</a>"
	},
	{
		"quote": "I think we finally have that next magical book we’ve been waiting for. The Shop Before Life has that sparkle, an utterly unique storyline, and clever thoughts to fill our heads. It was the best book I’ve read in a long time!",
		"cite": "Renee, <a target='_blank' rel='noopener noreferrer' href='https://www.goodreads.com/review/show/3066130843?book_show_action=true'>goodreads.com</a>"
	},
	{
		"quote": "One of a kind, but if I were to compare it to any story it would be The Wizard of Oz. What sets this book apart is the wry humor. I loved everything about it.",
		"cite": "Allison, <a target='_blank' rel='noopener noreferrer' href='https://www.goodreads.com/review/show/3120846869?book_show_action=true'>goodreads.com</a>"
	}
	
]