[
	{
		"quote": "I would <strong>highly recommend Neil as a humorous and inspirational speaker</strong> on anxiety and mental health. As well as amusing our sixth form, he gave practical advice on managing emotions in a very relatable way.",
		"cite": "Rowena Gill, Teacher,<a href='https://www.calday.co.uk/'> Calday Grange Grammar School</a>"
	},
	{
		"quote": "Informative and very real. Neil's personal challenges were explained using a witty and frank dialogue that the students appreciated. An excellent session.",
		"fuller_quote": "The session was informative and very real. Neil's personal challenges were explained using a witty and frank dialogue that the students appreciated. Neil described how he overcame, and is still overcoming his own mental health issues, using the walking on custard analogy. An excellent session.",
		"cite": "Marc Whisker, Head of Year 12, <a href='https://www.uptonhallschool.co.uk/'> Upton Hall School</a>"
	},
	{
		"quote": "Neil related very well to the students with humorous stories and his down to earth humility. All took something away to think about for the future.",
		"cite": "<a href='http://www.fettes.com/'>Fettes College, Edinburgh</a>"
	},
	{
		"quote": "Entertaining, light-hearted and truly inspirational to both staff and students. Having worked for 17 years in mainstream education before moving to a specialist mental health provision, <strong>I can whole-heartedly recommend Neil to any school</strong>.",
		"fuller_quote": "Neil came to Wirral Hospitals' School in July 2019 and spoke with our students, all of whom struggle with their own anxiety issues. Neil was truly inspirational, to both staff and students. He was entertaining and light-hearted, while giving a perfect description of what life can feel like for all of us at times. Neil's key message was one that we can, and will, take away with us and use whenever we need it. Having worked for 17 years in mainstream education, before moving to a specialist mental health provision, I can whole-heartedly recommend Neil to any school.",
		"cite": "Phillip Arrowsmith, Headteacher, Wirral Hospitals' School"
	},
	{
		"quote": "I would recommend Neil 100%. Every child was engaged, and those with anxiety hung on his every word. <strong>Can't wait to have Neil back.</strong>",
		"fuller_quote": "I would recommend Neil 100%. I have already mentioned the amazing talks you do in our local accelerator school meetings. The day was great. In both assemblies every child was engaged and you could see those children known to us with anxiety hanging on Neils every word. During the workshops it was nice to see those quieter children speak up about their feelings and emotions. Can't wait to have Neil back.",
		"cite": "Emma Pennington, New Brighton Primary"
	},
	{
		"quote": "It was a very good day. I enjoyed the workshop and Neil gave me advice to help me out with my feelings and emotions. I can now calm myself down and know how to look after myself.",
		"fuller_quote": "It was a very good day. I enjoyed the workshop and Neil gave me advice to help me out with my feelings and emotions. I can now calm myself down and know how to look after myself.",
		"cite": "A student, New Brighton Primary"
	},
	{
		"quote": "Fantastic day. I liked the game where we named a penguin. Mine was called Icy.",
		"fuller_quote": "Fantastic day. I liked the game we played where we named a penguin. Mine was called Icy.",
		"cite": "A student, New Brighton Primary"
	},
	{
		"quote": "Neil was very well received. Parents told us their children had commented positively at home. <strong>We would certainly like Neil to do further assemblies in future.</strong>",
		"fuller_quote": "The assemblies presented by Neil Hughes were very well received.  Some Y11 pupils have asked for his book to be stocked in the library.  We had comments from parents to say their children had gone home and commented positively on the assembly and, when asked, students from different year groups said they had found it very helpful.  We would certainly like to invite Neil to do further assemblies in future if this was possible.",
		"cite": "Neston High School"
	},
	{
		"quote": "The children really enjoyed Neil coming in to talk about mental health. They were fully engaged, and <strong>he managed to make this difficult topic accessible and funny to pupils in both Key Stage 1 and 2</strong>. Afterwards, he visited each class to answer questions and discuss any concerns or feelings they had. This was a really positive experience. It's a YES from us!",
		"fuller_quote": "The children really enjoyed Neil coming in to talk about mental health. During assembly they were fully engaged with Neil's presentation, and he managed to make this difficult topic accessible and funny to pupil's in both Key Stage 1 and 2. Neil then took the time to visit each class to answer questions and discuss any concerns or feelings they had. This was a really positive experience for them to be able to openly discuss their emotions in a safe environment with a trusted and knowledgeable adult. It's a YES from us!!",
		"cite": "Egremont Primary School"
	},
	{
		"quote": "Neil delivered <strong>engaging and interesting assemblies to over 800 pupils</strong>, presenting challenging subject matter in a style that made it easier for children to talk about mental health issues whilst also garnering smiles and laughs. It was a pleasure to host Neil for assemblies during this week.",
		"fuller_quote": "Neil delivered engaging and interesting assemblies to over 800 pupils as part of our whole school focus on World Mental Health Day. He presented challenging subject matter in a style that made it easier for children to talk about mental health issues whilst also garnering smiles and laughs from our pupils. The metaphor he used for anxiety throughout the assembly was a very interesting approach to thinking about mental health and certainly opened up the conversation. It was a pleasure to host Neil for assemblies during this week.",
		"cite": "The Oldershaw Academy"
	},
	{
		"quote": "Neil really helped me to appreciate a lot of aspects of poor mental health but [his talk] was really funny too!",
		"fuller_quote": "It was really good. The analogies and comparisons made everything easy to understand. We use a lot of words like anxiety and depression every day without really understanding the real meaning of them to people suffering from the conditions. I feel like it really helped me to appreciate a lot of aspects of poor mental health but it was really funny too!",
		"cite": "Martha, student, <a href='https://bsfc.ac.uk/blog/2020-02-12-14-27-47-walking-on-custard-college-gets-a-comedian-s-take-on-suffering-from-mental-healt'>Birkenhead Sixth Form College</a>"
	},
	{
		"quote": "Neil’s talks are a brilliant way to get across extremely complex problems in an entertaining way. His advice to help combat anxiety is excellent, and we’re extremely grateful that he was able to take the time to come and talk to us all.",
		"fuller_quote": "Neil’s talks are a brilliant way to get across extremely complex problems in an entertaining way. I think it really helps people to empathise with sufferers for one thing, but his deeply personal experiences of dealing with his mental health issues are relatable to a lot of people, and even may have helped some of us recognise a problem that we didn’t fully understand that we may be suffering from ourselves. His advice on solutions to help combat anxiety is excellent, and we’re extremely grateful that he was able to take the time to come and talk to us all.",
		"cite": "Jen Foden, Mental Health Lead, <a href='https://bsfc.ac.uk/blog/2020-02-12-14-27-47-walking-on-custard-college-gets-a-comedian-s-take-on-suffering-from-mental-healt'>Birkenhead Sixth Form College</a>"
	}


]
